# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BottleNeck, 3, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BottleNeck, 4, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BottleNeck, 6, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BottleNeck, 3, 5, 'relu']] # 7-P5/32


head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [-1, 1, DySample,  [2, 'lp']] # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256]]  # 14, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]   # 15, Y4, lateral_convs.1


  - [-1, 1, DySample,  [2, 'lp']] # 16 
  - [4, 1, SPDConv, [128]] # 17
  - [[-1, -2, 5], 1, Concat, [1]] # 18
  - [-1, 1, CSPFFTKernel, []] # 19
  - [-1, 3, RepC3, [256]] # 20

  - [-1, 1, ADownWithParallelFGM, [256]]   # 21
  - [[-1, 15], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [256]] # 23
  
  - [-1, 1, ADownWithParallelFGM, [256]]   # 24
  - [[-1, 10], 1, Concat, [1]] # 25
  - [-1, 3, RepC3, [256]] # 26
  
  - [[20, -1], 1, SFC_FGM, []] # 27 (P2综合的加强)

  - [[27, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)
